#coding=utf-8
def printPlayersHand(playerCards):
    
    # playerCards - массив вида [1, 1, 0, 0, 3, 0, 0, 2, 0, 0, 2, 0, 0, 1, 1]
    # 0 элемент массива - карта осел, 1 - 13 - карты соответствующие номинала; 14 - Джокер;
    # карта "Осел" у этого игрока;
    # у игрока 1 карта 1; 3 карты 4; 2 карты 7; 2 карты 10;
    # 1 карта 13; 1 карта джокера;
   
   # Игральные карты
    cards = [
        ['+---+', '|Os |', '| Os|', '+---+' ],
        ['+---+', '|1  |', '|  1|', '+---+' ],
        ['+---+', '|2  |', '|  2|', '+---+' ],
        ['+---+', '|3  |', '|  3|', '+---+' ],
        ['+---+', '|4  |', '|  4|', '+---+' ],
        ['+---+', '|5  |', '|  5|', '+---+' ],
        ['+---+', '|6  |', '|  6|', '+---+' ],
        ['+---+', '|7  |', '|  7|', '+---+' ],
        ['+---+', '|8  |', '|  8|', '+---+' ],
        ['+---+', '|9  |', '|  9|', '+---+' ],
        ['+---+', '|10 |', '| 10|', '+---+' ],
        ['+---+', '|11 |', '| 11|', '+---+' ],
        ['+---+', '|12 |', '| 12|', '+---+' ],
        ['+---+', '|13 |', '| 13|', '+---+' ],
        ['+---+', '|J  |', '|  J|', '+---+' ]
    ]

    line1 = ''
    line2 = ''
    line3 = ''
    line4 = ''

    for i in range(len(playerCards)):      # Перебираем руку игрока
        card = playerCards[i]              # Смотрим сколько карт определенного номинала на руке
        for j in range(card):              # Добовляем карты card раз в ввывод
            line1 += cards[i][0] + '  '    # Формируем строки для вывода
            line2 += cards[i][1] + '  '
            line3 += cards[i][2] + '  '
            line4 += cards[i][3] + '  '
    
    # Выводим руку
    print(line1)
    print(line2)
    print(line3)
    print(line4)

if __name__ == "__main__":
    plHands = [1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
    printPlayersHand(plHands)
